## staging: ecr-us-east
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 2 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                  NAME                                   |
|--------|-------------------------------------------------------------------------|
| add    | `aws_ecr_repository.ses_receiving_emails`                               |
|        | `aws_secretsmanager_secret_version.ses_receiving_emails_repository_url` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecr_repository.ses_receiving_emails will be created
  + resource "aws_ecr_repository" "ses_receiving_emails" {
      + arn                  = (known after apply)
      + force_delete         = false
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "notify/ses_receiving_emails"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_secretsmanager_secret_version.ses_receiving_emails_repository_url will be created
  + resource "aws_secretsmanager_secret_version" "ses_receiving_emails_repository_url" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:SES_RECEIVING_EMAILS_REPOSITORY_URL-kJdtvp"
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + ses_receiving_emails_ecr_arn            = (known after apply)
  + ses_receiving_emails_ecr_repository_url = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.ses_receiving_emails"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.ses_receiving_emails_repository_url"]

21 tests, 19 passed, 2 warnings, 0 failures, 0 exceptions

```

</details>
